{
  "Block": "Bloquear",
  "Balance": "Saldo",
  "Connect": "Conectar",
  "Check Metamask Extension": "Verificar extensión de Metamask",
  "The Metamask wallet extension needs to be installed.": "Es necesario instalar la extensión del monedero Metamask.",
  "Check Metamask Status": "Verificar estado de Metamask",
  "The Metamask wallet needs to be unlocked.": "El monedero Metamask debe estar desbloqueado.",
  "Check Metamask Network": "Verificar red de Metamask",
  "A supported network needs to be selected in the Metamask wallet.": "En el monedero Metamask debe seleccionarse una red compatible.",
  "Check Metamask Signature": "Verificar firma de Metamask",
  "The login request needs to be signed in the Metamask wallet.": "La solicitud de inicio de sesión debe ser firmada en el monedero Metamask.",
  "Connecting to Metamask": "Conectando a Metamask",
  "Unexpected Error": "Error inesperado",
  "An error has occurred during the wallet status check.": "Se ha producido un error durante la verificación del estado del monedero.",
  "Please try again later.": "Por favor, inténtalo de nuevo más tarde.",
  "The error code was": "El código de error fue:",
  "Wallet Is Locked": "El monedero está bloqueado",
  "Please unlock your wallet if you want to continue.": "Desbloquea tu monedero si deseas continuar.",
  "Unlock Requested": "Solicitud de desbloqueo solicitada",
  "Waiting for the unlock wallet request to be accepted.": "Esperando la aceptación de la solicitud de desbloqueo del monedero.",
  "Please check your Metamask wallet.": "Por favor, verifica tu monedero Metamask.",
  "Unlock Rejected": "Desbloqueo rechazado",
  "You rejected the unlock wallet request.": "Has rechazado la solicitud de desbloqueo del monedero.",
  "Please try again if you want to continue.": "Por favor, inténtalo de nuevo si deseas continuar.",
  "Waiting Unlock": "Esperando desbloqueo",
  "You haven't unlocked your wallet yet.": "Aún no has desbloqueado tu monedero.",
  "Please close this window, open your wallet, unlock it, and click connect button again.": "Por favor, cierra esta ventana, abre tu monedero, desbloquéalo y haz clic nuevamente en el botón de conexión.",
  "An error has occurred during the unlock wallet check.": "Se ha producido un error durante la verificación del desbloqueo del monedero.",
  "Unlock Wallet": "Desbloquear monedero",
  "An error has occurred during the network check.": "Se ha producido un error durante la verificación de la red.",
  "Wrong Network": "Red incorrecta",
  "Current network is not supported by this app.": "La red actual no es compatible con esta aplicación.",
  "If you want to continue, please switch to any supported network. ": "Si deseas continuar, cambia a cualquier red compatible.",
  "Network Switch Requested": "Solicitud de cambio de red solicitada",
  "Waiting for the network switch request to be accepted.": "Esperando la aceptación de la solicitud de cambio de red.",
  "Switch Rejected": "Cambio de red rechazado",
  "You rejected the network switch request.": "Has rechazado la solicitud de cambio de red.",
  "An error has occurred during the network switch request.": "Se ha producido un error durante la solicitud de cambio de red.",
  "Switch Network": "Cambiar red",
  "SIGN_MESSAGE": "Por favor, firma el siguiente mensaje para iniciar sesión:",
  "Sign Required": "Firma requerida",
  "In order to use this app, you need to sign the login request in your wallet.": "Para utilizar esta aplicación, debes firmar la solicitud de inicio de sesión en tu monedero.",
  "Waiting Signature": "Esperando firma",
  "Waiting for the login request to be signed.": "Esperando que la solicitud de inicio de sesión sea firmada.",
  "Sign Rejected": "Firma rechazada",
  "You rejected the sign request.": "Has rechazado la solicitud de firma.",
  "Sign Timed Out": "Tiempo de firma agotado",
  "You didn't respond to the sign request in time.": "No respondiste a tiempo a la solicitud de firma.",
  "An error has occurred during the sign check.": "Se ha producido un error durante la verificación de la firma.",
  "Signed In": "Sesión iniciada",
  "You have successfully signed the login request.": "Has firmado exitosamente la solicitud de inicio de sesión.",
  "Redirecting to app...": "Redirigiendo a la aplicación...",
  "Sign In": "Iniciar sesión",
  "Cancel": "Cancelar",
  "Metamask Is Not Detected": "Metamask no detectado",
  "The Metamask wallet extension is not detected in your browser.": "La extensión del monedero Metamask no se detecta en tu navegador.",
  "In order to use this app, please install the Metamask extension for your browser from the official link below and try again.": "Para utilizar esta aplicación, instala la extensión de Metamask para tu navegador desde el enlace oficial a continuación y vuelve a intentarlo.",
  "Dashboard": "Tablero",
  "Copy Address": "Copiar dirección",
  "View on Explorer": "Ver en el explorador",
  "Disconnect": "Desconectar",
  "Address copied.": "Dirección copiada",
  "The address of your account has been copied to the clipboard.": "La dirección de tu cuenta ha sido copiada al portapapeles.",
  "401 Unauthorized": "401 No autorizado",
  "You need to connect your wallet to see this page.": "Debes conectar tu monedero para ver esta página.",
  "Register": "Registrarse",
  "Login": "Iniciar sesión"
}
